jjpvz/evd1/evdk_workspace_targets/frdmmcxn947_evdk5_0/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCameraPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCameraPins(void)
{
    /* Enables the clock for GPIO1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio1);
    /* Enables the clock for GPIO3: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio3);
    /* Enables the clock for INPUTMUX: Enables clock */
    CLOCK_EnableClock(kCLOCK_InputMux0);
    /* Enables the clock for PORT0 controller: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port0);
    /* Enables the clock for PORT1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port1);
    /* Enables the clock for PORT2: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port2);
    /* Enables the clock for PORT3: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port3);

    gpio_pin_config_t CAM_D0_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_4 (pin A4)  */
    GPIO_PinInit(BOARD_INITCAMERAPINS_CAM_D0_GPIO, BOARD_INITCAMERAPINS_CAM_D0_PIN, &CAM_D0_config);

    gpio_pin_config_t CAM_D1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_5 (pin B3)  */
    GPIO_PinInit(BOARD_INITCAMERAPINS_CAM_D1_GPIO, BOARD_INITCAMERAPINS_CAM_D1_PIN, &CAM_D1_config);

    gpio_pin_config_t CAM_D2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_6 (pin B2)  */
    GPIO_PinInit(BOARD_INITCAMERAPINS_CAM_D2_GPIO, BOARD_INITCAMERAPINS_CAM_D2_PIN, &CAM_D2_config);

    gpio_pin_config_t CAM_D3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_7 (pin A2)  */
    GPIO_PinInit(BOARD_INITCAMERAPINS_CAM_D3_GPIO, BOARD_INITCAMERAPINS_CAM_D3_PIN, &CAM_D3_config);

    gpio_pin_config_t CAM_D6_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_10 (pin C3)  */
    GPIO_PinInit(BOARD_INITCAMERAPINS_CAM_D6_GPIO, BOARD_INITCAMERAPINS_CAM_D6_PIN, &CAM_D6_config);

    gpio_pin_config_t CAM_D7_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_11 (pin D3)  */
    GPIO_PinInit(BOARD_INITCAMERAPINS_CAM_D7_GPIO, BOARD_INITCAMERAPINS_CAM_D7_PIN, &CAM_D7_config);

    gpio_pin_config_t CAM_PDWN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_18 (pin G4)  */
    GPIO_PinInit(BOARD_INITCAMERAPINS_CAM_PDWN_GPIO, BOARD_INITCAMERAPINS_CAM_PDWN_PIN, &CAM_PDWN_config);

    gpio_pin_config_t CAM_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_19 (pin G5)  */
    GPIO_PinInit(BOARD_INITCAMERAPINS_CAM_RST_GPIO, BOARD_INITCAMERAPINS_CAM_RST_PIN, &CAM_RST_config);

    gpio_pin_config_t CAM_D4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_4 (pin F14)  */
    GPIO_PinInit(BOARD_INITCAMERAPINS_CAM_D4_GPIO, BOARD_INITCAMERAPINS_CAM_D4_PIN, &CAM_D4_config);

    gpio_pin_config_t CAM_D5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_5 (pin G14)  */
    GPIO_PinInit(BOARD_INITCAMERAPINS_CAM_D5_GPIO, BOARD_INITCAMERAPINS_CAM_D5_PIN, &CAM_D5_config);

    /* Interrupt configuration on GPIO1_11 (pin D3): Interrupt/DMA request is disabled */
    GPIO_SetPinInterruptConfig(BOARD_INITCAMERAPINS_CAM_D7_GPIO, BOARD_INITCAMERAPINS_CAM_D7_PIN, kGPIO_InterruptStatusFlagDisabled);
    /* P0_4 is selected for SMARTDMA arch B 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_GpioPort0Pin4ToSmartDma);
    /* P0_11 is selected for SMARTDMA arch B 1 */
    INPUTMUX_AttachSignal(INPUTMUX0, 1U, kINPUTMUX_GpioPort0Pin11ToSmartDma);
    /* P0_5 is selected for SMARTDMA arch B 2 */
    INPUTMUX_AttachSignal(INPUTMUX0, 2U, kINPUTMUX_GpioPort0Pin5ToSmartDma);

    /* PORT0_11 (pin B11) is configured as PIO0_11 */
    PORT_SetPinMux(BOARD_INITCAMERAPINS_CAM_HSYNC_PORT, BOARD_INITCAMERAPINS_CAM_HSYNC_PIN, kPORT_MuxAlt0);

    PORT0->PCR[11] = ((PORT0->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_4 (pin B14) is configured as PIO0_4 */
    PORT_SetPinMux(BOARD_INITCAMERAPINS_CAM_VSYNC_PORT, BOARD_INITCAMERAPINS_CAM_VSYNC_PIN, kPORT_MuxAlt0);

    PORT0->PCR[4] = ((PORT0->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_5 (pin A14) is configured as PIO0_5 */
    PORT_SetPinMux(BOARD_INITCAMERAPINS_CAM_PCLK_PORT, BOARD_INITCAMERAPINS_CAM_PCLK_PIN, kPORT_MuxAlt0);

    PORT0->PCR[5] = ((PORT0->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_10 (pin C3) is configured as PIO1_10 */
    PORT_SetPinMux(BOARD_INITCAMERAPINS_CAM_D6_PORT, BOARD_INITCAMERAPINS_CAM_D6_PIN, kPORT_MuxAlt0);

    PORT1->PCR[10] = ((PORT1->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_11 (pin D3) is configured as PIO1_11 */
    PORT_SetPinMux(BOARD_INITCAMERAPINS_CAM_D7_PORT, BOARD_INITCAMERAPINS_CAM_D7_PIN, kPORT_MuxAlt0);

